[
  {
    "video_number": 1,
    "headline": "Pope Leo demands priests stop using AI to write sermons over TikTok panic",
    "source": "Reddit - r/nottheonion",
    "url": "https://www.irishstar.com/news/us-news/pope-leo-demands-priests-stop-36787011",
    "script": [
      {
        "scene_number": 1,
        "veo3_visual_prompt": "PRIEST MICHAEL, mid-30s, earnest and clean-shaven, in a neatly pressed black cassock, excitedly taps and scrolls through content on a gleaming smartphone held close to his face, a look of impressed concentration on his features. He's in a cluttered sacristy, shelves behind him packed with ancient liturgical books and a half-eaten bag of convenience store snacks. CARDINAL BENEDICT, mid-40s, sharp but with a faint shadow of fatigue under his eyes, in immaculate cardinal robes, stands slightly behind and to the side, peering over Michael's shoulder with a mixture of curiosity and mild apprehension. CAMERA: Medium shot, static, slightly low angle. STYLE: Soft, warm lighting, hinting at sacred but lived-in space. 9:16 vertical portrait aspect ratio",
        "dialogue": "Priest Michael: (beaming) 'Check it out, Cardinal! AI-generated. 'Galatians 5:1 – Don't be a spiritual simp, stay free in Christ!' So relatable! Already trending on 'For You Page: Faith Edition!''\nCardinal Benedict: (muttering, barely audible) 'Spiritual... simp?'",
        "audio_cues": "Upbeat, slightly generic pop music beat subtly playing from the phone. A faint 'ding!' notification sound."
      },
      {
        "scene_number": 2,
        "veo3_visual_prompt": "POPE LEO, mid-70s, wearing traditional white papal vestments, sits stiffly at a heavy, ornate wooden desk. His face is a mask of weary exasperation as he holds a tablet displaying a video of a young priest in a brightly lit chapel performing a choppy, arm-waving 'sermon dance challenge' in front of an altar, a large 'SMASH THAT LIKE BUTTON!' graphic superimposed over the crucifix. Behind the Pope, a second, smaller tablet shows another AI-generated 'sermon' using aggressive meme overlays. CARDINAL BENEDICT, looking increasingly overwhelmed, frantically tries to minimize windows on a third tablet, his brow furrowed in quiet horror. CAMERA: Close-up, slow push-in on Pope Leo's face, then rack focus to the tablets. STYLE: High contrast, almost frantic lighting, traditional meets digital. 9:16 vertical portrait aspect ratio",
        "dialogue": "Pope Leo: (voice rising with incredulity) 'And this one suggests we integrate 'Holy Spirit filter challenges' into the Benediction! The youth crave engagement, they say! Engagement?!'\nCardinal Benedict: (softly, defeated) 'It's... it's just really good at identifying viral trends, Your Holiness.'",
        "audio_cues": "Fast-paced, high-energy electronic music playing from the tablets. Distant, muffled 'clap' and 'whoosh' sound effects from the dance video. A 'boing!' sound as Cardinal Benedict struggles with his tablet."
      },
      {
        "scene_number": 3,
        "veo3_visual_prompt": "POPE LEO, now visibly trembling with frustration, is standing before a majestic, ancient stained-glass window in a grand papal hall, trying to dictate a stern decree into a sophisticated voice-to-text AI device. The device, sleek and futuristic, sits on a heavy velvet stand. Behind him, on a massive, wall-mounted display screen, his words 'By Papal Decree, I demand a cessation...' are being graphically auto-corrected and enhanced by the AI into a rapidly animating, neon-lit text graphic that reads: 'DROP THE MIC, NOT THE CROSS! #POPELEO #AIPREACHBAN #GETOFFMYTIKTOK'. CARDINAL BENEDICT, standing perfectly still a few feet away, has completely given up; his head is slightly bowed, eyes closed, a single tear slowly rolling down his cheek. CAMERA: Dolly-out, revealing the full absurdity of the screen behind the Pope and Benedict's utter despair. STYLE: Epic, dramatic lighting, juxtaposed with the garish screen, extreme visual irony. 9:16 vertical portrait aspect ratio",
        "dialogue": "Pope Leo: (shouting, exasperated) '—I DEMAND an IMMEDIATE cessation of all AI-generated sermon content! EFFECTIVE IMMEDIATELY!'\nAI Voice: (cheery, synthesized, echoing through the grand hall) 'Okay, Boomer! Serving up some serious righteous vibes with this decree! Hashtag blessed!'",
        "audio_cues": "A booming, generic 'thump-thump' beat drops as the AI graphic appears. A rapid series of 'swoosh' and 'glitch' sounds from the screen. A final, loud 'mic drop' sound effect from the AI device. Cardinal Benedict lets out a barely audible, despairing sigh."
      }
    ]
  },
  {
    "video_number": 2,
    "headline": "The Taliban’s new penal code: Two weeks in jail for breaking a woman’s arm and five months for mistreating a camel",
    "source": "Reddit - r/nottheonion",
    "url": "https://english.elpais.com/international/2026-02-25/the-talibans-new-penal-code-two-weeks-days-in-jail-for-breaking-a-womans-arm-and-five-months-for-mistreating-a-camel.html",
    "script": [
      {
        "scene_number": 1,
        "veo3_visual_prompt": "SABA (30s, modest olive-green tunic, determined expression) is seated opposite CHAIRMAN FAHAD (60s, stern face, traditional flowing white robes, heavy silver ring, adjusting spectacles). CLERK ZAHIR (20s, grey uniform, furiously scribbling in a large leather-bound ledger) sits beside Fahad, head down. Saba leans slightly forward, holding a crumpled legal document. Fahad holds a much larger, ornate ledger open on his dusty wooden desk, finger tracing lines. Zahir's pen scratches furiously. A brass teapot and flickering oil lamp are on the desk. A faded 'Justice Prevails' tapestry hangs crookedly on the mud-brick wall behind Fahad. Medium shot, slightly low angle on Saba, then a slow push-in to a close-up on Fahad's face as he speaks. Warm, oppressive golden hour lighting filtering through a small window, gritty realism, 9:16 vertical portrait aspect ratio.",
        "dialogue": "SABA: (earnest but hopeful) But Excellency, surely two weeks for a broken arm is… lenient? She needed surgery.\nCHAIRMAN FAHAD: (calm, authoritative) The new code is clear. Section 7b. Assault causing minor fracture: two weeks. Next case.\nSABA: (confused, a slight frown) Next case? But the severity...\nCHAIRMAN FAHAD: (interrupting smoothly) Mistreating a desert dromedary, however, per Section 12c, carries a five-month incarceration. Perhaps even flogging.",
        "audio_cues": "Distant street sounds, quill scratching, metallic clang of spectacles, a low, ominous drone begins subtly"
      },
      {
        "scene_number": 2,
        "veo3_visual_prompt": "SABA (face now showing tightly controlled frustration, eyes slightly wide with disbelief) is staring, unblinking, directly at the camera. CHAIRMAN FAHAD (calm, meticulous, his eyes focused) is delicately polishing a miniature, intricately carved wooden camel figurine with a small silk cloth on his desk. CLERK ZAHIR (grinning, eager to contribute, holding up a small scroll) looks expectantly at Fahad. Saba clenches her jaw. Fahad slowly rotates the camel figurine in his hand. Zahir unfurls the scroll. The camel figurine catches the dim light. Behind Zahir, a framed certificate reads 'Outstanding Service to Livestock.' Close-up on Saba's face, then cuts to a close-up on Fahad's hands polishing the camel, then a quick medium shot of Zahir. Muted, oppressive lighting, 9:16 vertical portrait aspect ratio.",
        "dialogue": "SABA: (voice tight, trying to remain respectful) Forgive my persistence, Excellency, but a human life… a broken bone versus… a slightly unhappy camel?\nCHAIRMAN FAHAD: (without looking up from polishing) A slightly unhappy camel can lead to a deeply unhappy caravan. A deeply unhappy caravan disrupts commerce. Disrupted commerce destabilizes the region. Do you wish to destabilize the region, Saba?\nSABA: (swallowing, a beat of silence) No, Excellency. Of course not.\nCLERK ZAHIR: (eagerly) And for disturbing the sleep of a rare white falcon? Article 19g states a full year, Excellency!",
        "audio_cues": "Soft cloth buffing wood, rustle of parchment, a distant bird cry, Saba's strained breath"
      },
      {
        "scene_number": 3,
        "veo3_visual_prompt": "CHAIRMAN FAHAD (suddenly alert, eyes wide with genuine horror, clutching his chest) has just dropped a beautiful, ceremonial camel staff (carved wood with silver inlay), which lays on the dusty floor. SABA (slumped, utterly defeated, expressionless save for a single tear silently tracing her cheek) stares vacantly forward. CLERK ZAHIR (terrified, wide-eyed, holding a tiny, fluffy white PUPPY that is yelping loudly) is frozen in fear, the puppy wiggling in his grasp. Fahad stumbles back from his desk, knocking over a stack of scrolls. Saba doesn't move, barely registers the chaos. Zahir tries to comfort the puppy but is more afraid of Fahad's reaction. A 'Protect Our Dromedaries' poster is visible in the background. Slow push-in on Fahad's horrified face, then a quick cut to an extreme close-up of the yelping puppy, then a static medium shot of Saba's utterly defeated expression, focusing on the tear. Dramatic lighting, sharp contrasts, heightened absurdity, 9:16 vertical portrait aspect ratio.",
        "dialogue": "SABA: (resigned, almost whispering) What about… a more severe human crime? What if someone… killed a person?\nCHAIRMAN FAHAD: (ponders, then waves a dismissive hand) Oh, a person? Ah, Article 21a. Family dispute. Perhaps a fine. Or a stern talking-to. Community service for a month, maybe.\nPUPPY: (Loud, distressed yelp!)\nCHAIRMAN FAHAD: (eyes snap open, horrified, dropping staff with a CLANG) ZAHIR! You let that innocent creature feel PAIN? This is an outrage! Three years! No, five! Straight to the maximum security camel stable! And you, Saba! For witnessing this atrocity without intervening! Two months! Get them out of my sight!\nSABA: (A tiny, almost inaudible sigh of pure, utter defeat.)",
        "audio_cues": "Loud, desperate puppy yelps, clatter of dropped staff, rustling scrolls, Fahad's booming voice, Saba's barely audible sigh, a single mournful note on a string instrument"
      }
    ]
  },
  {
    "video_number": 3,
    "headline": "Russia to relax labour laws allowing minors to do ‘dangerous’ jobs amid manpower shortage",
    "source": "Reddit - r/nottheonion",
    "url": "https://novayagazeta.eu/articles/2026/02/26/russia-to-relax-labour-laws-allowing-minors-to-do-dangerous-jobs-amid-manpower-shortage-en-news",
    "script": [
      {
        "scene_number": 1,
        "veo3_visual_prompt": "A solemn 10-year-old boy, Misha, in an oversized safety vest, expertly operating a compact but industrial yellow forklift, carefully stacking heavy wooden crates in a dimly lit, vast warehouse. Dust motes dance in shafts of light. CAMERA: medium shot, slightly low angle, following Misha as he maneuvers. STYLE: grimy industrial, muted colors. 9:16 vertical portrait aspect ratio",
        "dialogue": "Supervisor IRINA: (matter-of-fact) Young Misha here, top of his class. Very nimble. \nDMITRI: (wearily) He's… ten. Is this forklift rated for… human operation? \nSupervisor IRINA: (sternly) Manpower shortage, Dmitri. He’s very productive.",
        "audio_cues": "Hum of distant machinery, clatter of crates, subtle forklift beeps."
      },
      {
        "scene_number": 2,
        "veo3_visual_prompt": "A focused 12-year-old girl, Svetlana, in an ill-fitting, charred welding helmet and thick leather gloves, intensely focused on a sparking arc welder, joining two massive steel beams in a deafening, cavernous factory. Blue sparks fly dramatically. CAMERA: close-up on her hands and the intense welding light, then quick cut to Dmitri’s flinching face. STYLE: harsh industrial lighting, high contrast. 9:16 vertical portrait aspect ratio",
        "dialogue": "Supervisor IRINA: (proudly) Our Svetlana, mastering the plasma arc. Precision work. Saves us hiring three adults. \nDMITRI: (deadpan, voice slightly strained) She's welding a support beam. For the building. \nSvetlana: (muffled, focused) Almost done, Comrade Supervisor! Just this critical load-bearing joint!",
        "audio_cues": "Loud, high-pitched sizzle of arc welding, metallic clang, Dmitri's muffled wince."
      },
      {
        "scene_number": 3,
        "veo3_visual_prompt": "A tiny, stern 7-year-old boy, Sergei, in a pristine, oversized military uniform, sitting in a high-backed command chair in a dimly lit, futuristic nuclear launch control room. His small fingers hover over a large, glowing red button labeled 'LAUNCH'. Complex schematics scroll on surrounding screens, casting an eerie glow on his serious face. CAMERA: slow push-in on the boy's serious face, then his hand, then Dmitri's utterly broken expression. STYLE: tense, dramatic, cool blue and red lighting. 9:16 vertical portrait aspect ratio",
        "dialogue": "Supervisor IRINA: (calmly, proudly) And finally, our youngest recruit, Comrade Sergei. Handles the strategic deterrent. Very good with numbers. \nDMITRI: (whispering, quiet horror) The… the *button*? He… he's in charge of the button? \nSergei: (serious, tiny voice) Just waiting for confirmation codes, Comrade Dmitri. Papa says if I press it too early, I don't get ice cream. \nDMITRI: (staring blankly, defeated, a tear slowly rolling down his cheek) Ice cream...",
        "audio_cues": "Low, ominous hum of machinery, gentle beeps and clicks from control panels, a final, defeated sigh from Dmitri."
      }
    ]
  },
  {
    "video_number": 4,
    "headline": "Jonathan Majors Mounts Movie Comeback With an Untitled Action Film From The Daily Wire",
    "source": "Reddit - r/nottheonion",
    "url": "https://www.joblo.com/jonathan-majors-the-daily-wire-action-film/",
    "script": [
      {
        "scene_number": 1,
        "veo3_visual_prompt": "JONATHAN MAJORS (wearing a sharp, generic grey suit, looking serious but tired) sits across a sleek, modern conference table, reviewing storyboards. CHAD (mid-30s, clean-cut, overly energetic, wearing a Daily Wire branded polo) gestures wildly at a large monitor displaying crude stick-figure action sequences. ADRIENNE (mid-20s, disheveled ponytail, holding a clipboard like a shield, dark circles under her eyes) stares blankly. The room is minimalist, but a 'CULTURE WARS HQ' sign is subtly visible in the background. CAMERA: medium shot, static, slight low angle on Chad emphasizing his energy, capturing their expressions. 9:16 vertical portrait aspect ratio.",
        "dialogue": {
          "CHAD": "(Beaming, gesturing emphatically) ...and then, BAM! You land the final blow, severing the Woke agenda from the fabric of society itself!",
          "JONATHAN MAJORS": "(Gravelly, thoughtful) So, I'm... physically punching a concept?",
          "ADRIENNE": "(Quietly, to herself, rubbing her temples) Another Tuesday."
        },
        "audio_cues": "Upbeat, slightly generic action movie score underscores. Distant, muffled sounds of construction. Gentle hum of server racks."
      },
      {
        "scene_number": 2,
        "veo3_visual_prompt": "JONATHAN MAJORS (now in full tactical gear, sweat glistening, looking determined) is suspended from wires on a sparse sound stage, mid-air. He's performing a complicated martial arts kick towards a large, inflatable, rainbow-colored 'Sensitivity Training Manual' prop, which wobbles cartoonishly. KEVIN (mid-40s, slicked-back hair, expensive suit, holding a branded coffee mug) watches with an approving smirk, next to CHAD (still beaming, clutching a megaphone). ADRIENNE (face utterly devoid of emotion, clutching her clipboard, looking at her watch) stands a few feet away, shoulders slumped. CAMERA: slow push-in, medium shot, handheld, capturing the frantic energy. 9:16 vertical portrait aspect ratio.",
        "dialogue": {
          "CHAD": "(Through megaphone, slightly distorted) More conviction, JM! Show that manual who's boss!",
          "JONATHAN MAJORS": "(Straining, grunting) It's... surprisingly resilient!",
          "KEVIN": "(Chuckles, sips coffee smugly) That's the insidious nature of it, Jonathan. Gotta dismantle it piece by piece. Visually.",
          "ADRIENNE": "(Muttering, pinching the bridge of her nose) 'Visually dismantle the insidious nature.' Got it."
        },
        "audio_cues": "WHUMP (JM hitting the prop). Squeaking of wires. Enthusiastic claps from Chad and Kevin. Whirring of a large industrial fan."
      },
      {
        "scene_number": 3,
        "veo3_visual_prompt": "Extreme close-up on JONATHAN MAJORS' face (grimacing, covered in glitter and what looks like fake tears) as he strains to hold back a cascading wave of enormous, physical 'microaggressions' (represented by oversized, brightly colored pillows with words like 'mansplaining,' 'gaslighting,' 'cultural appropriation' emblazoned on them) with his bare hands. He is knee-deep in a literal 'Cancel Culture Swamp' (green goo and discarded 'woke' merchandise). In the background, out of focus, CHAD and KEVIN are high-fiving behind a monitor showing a triumphantly rendered graphic of a 'deconstructed' pronoun wheel. ADRIENNE is lying face-down on a pile of discarded 'inclusive' children's books, a single tear rolling down her cheek. CAMERA: extreme close-up on JM's face, then slowly dollying out to a medium shot revealing the full absurdity, slightly low angle. 9:16 vertical portrait aspect ratio.",
        "dialogue": {
          "CHAD": "(Yelling with pure glee) Hold the line, Jonathan! Don't let the intersectionality wash over you!",
          "JONATHAN MAJORS": "(Gasping, almost inaudible, eyes wide) I can't... the pronouns... they're too heavy!",
          "KEVIN": "(Pumping his fist, triumphant) This is it, folks! This is the cultural victory! The sequel writes itself!",
          "ADRIENNE": "(Muffled, into a pillow, voice cracking) Just... put me in the swamp. Just end it."
        },
        "audio_cues": "Squishing sounds of the swamp. WHOOSH of cascading pillows. OMINOUS SYNTH score swells. Distant triumphant fanfare. Adrienne's muffled groan."
      }
    ]
  },
  {
    "video_number": 5,
    "headline": "Kalshi reveals insider trading case against editor for MrBeast",
    "source": "Reddit - r/nottheonion",
    "url": "https://www.npr.org/2026/02/25/nx-s1-5726050/kalshi-insider-trading-enforcement-actions",
    "script": [
      {
        "scene_number": 1,
        "veo3_visual_prompt": "AGENT THOMPSON, a stern woman in a crisp suit, leans aggressively across a stark, stainless-steel table. AGENT MILLER, a weary-looking man in a rumpled suit, sits silently beside her. BRAD, a disheveled young man with wide eyes, nervously clutches his hands. A single, bare bulb hangs overhead. CAMERA: Medium shot, static, capturing the tension. STYLE: Harsh, fluorescent lighting, oppressive mood. 9:16 vertical portrait aspect ratio",
        "dialogue": "Agent Thompson: (intense, accusatory) This isn't just about knowing 'who wins the Squid Game recreation.' This is about material non-public information, Mr. Jensen. Financial markets were impacted.\nBrad: (stammering) I… I just knew MrBeast thought the green light, red light girl looked a little too… unenthusiastic. So he'd probably cut her out early.",
        "audio_cues": "Hum of fluorescent lights, subtle clinking of Brad's hands, sharp intake of breath from Thompson."
      },
      {
        "scene_number": 2,
        "veo3_visual_prompt": "AGENT THOMPSON gestures forcefully at a whiteboard filled with complex flowcharts and graphs, all meticulously detailing 'Viewer Retention,' 'Engagement Spikes,' and 'Optimal Jump Scare Placement.' AGENT MILLER pinches the bridge of his nose, eyes closed in quiet despair. BRAD stares blankly at the board, completely overwhelmed. CAMERA: Slow push-in on the whiteboard details, then a close-up on Miller's face, then back to the scene. STYLE: Overly dramatic presentation, clinical lighting. 9:16 vertical portrait aspect ratio",
        "dialogue": "Agent Thompson: (pointing with a laser pointer) And here, Mr. Jensen, you bet heavily on 'MrBeast's Editor Pranks His Crew Part 3' underperforming. Why? How did you know the giant rubber chicken wouldn't get a laugh?\nBrad: (confused, quiet) Because… because it broke. During the first take. We had to use the one with the slightly deflated comb. It wasn't as funny.",
        "audio_cues": "Whirring sound of a projector, faint squeak of Thompson's laser pointer, Miller's quiet, exasperated sigh."
      },
      {
        "scene_number": 3,
        "veo3_visual_prompt": "A grand, oak-paneled hearing room. AGENT THOMPSON stands triumphantly at a podium, a massive, ornate gavel resting beside her. On a giant screen behind her, a blurry, extreme close-up of a half-eaten sandwich with a single bite mark is projected. BRAD sits slumped in a witness chair, looking utterly defeated, tears welling in his eyes. AGENT MILLER sits in the front row, completely motionless, staring straight ahead with dead eyes, a single, unblinking tear tracing a path down his cheek. CAMERA: Static locked-off wide shot of the hearing room, slowly zooming out to reveal the full absurdity. STYLE: Formal, oppressive, yet absurdly lit on the sandwich. 9:16 vertical portrait aspect ratio",
        "dialogue": "Agent Thompson: (dramatically, booming) And the smoking gun, ladies and gentlemen of the jury, the definitive piece of insider information that caused a near-catastrophic market correction in the 'Will MrBeast actually finish that 10,000 calorie pizza?' market…\nBrad: (sobbing) He said it tasted like… like sadness. He wasn't going to finish it. I just… I knew!",
        "audio_cues": "Dramatic courtroom music swells briefly, then cuts abruptly to Brad's sob. The faint whir of the projector, a single drip of water from a leaky ceiling somewhere in the background, amplifying Miller's silent despair."
      }
    ]
  }
]