{
  "video_number": 1,
  "headline": "Pope Leo demands priests stop using AI to write sermons over TikTok panic",
  "source": "Reddit - r/nottheonion",
  "url": "https://www.irishstar.com/news/us-news/pope-leo-demands-priests-stop-36787011",
  "script": [
    {
      "scene_number": 1,
      "veo3_visual_prompt": "MONSIGNOR ANTHONY, a severe man with sharp features and greying temples, wearing crisp, deep purple vestments, stands rigidly. CARDINAL BENEDICT, his face etched with world-weariness and dark circles under his eyes, sits slumped. FATHER MICHAEL and FATHER GREGORY, both young-ish priests with nervous energy, fidget in their traditional black cassocks. Monsignor grips a heavy, parchment scroll with white-knuckled intensity. Cardinal Benedict slowly rubs his temples. Fathers Michael and Gregory exchange worried glances. A grand, darkly paneled Vatican meeting room, opulent yet somber, with an ancient, long dark oak table and faded tapestries depicting biblical scenes. Dust motes dance in shafts of weak light. CAMERA: Medium shot, static, slightly low angle emphasizing Monsignor's imposing figure. STYLE: Dim, classical, dramatic lighting, conveying a mood of serious confrontation. 9:16 vertical portrait aspect ratio",
      "dialogue": "MONSIGNOR ANTHONY: (Gravely) His Holiness has noted... a disturbing trend. 'Sermon generation methodologies,' as he terms them, are... unorthodox.\nFATHER MICHAEL: (Nervously) Unorthodox, Monsignor? We merely sought... efficiency. To better serve the flock.\nCARDINAL BENEDICT: (Quietly, to himself, eyes closed) The flock prefers truth, not optimization.",
      "audio_cues": "Ominous, low-key Gregorian chant. Faint distant church bells."
    },
    {
      "scene_number": 2,
      "veo3_visual_prompt": "FATHER GREGORY, face pale with anxiety, nervously clutches a rosary-like device, its beads actually small, glowing LED buttons. FATHER MICHAEL, attempting to appear calm but sweating, gestures vaguely at a sleek, glowing tablet. MONSIGNOR ANTHONY observes with a piercing, suspicious gaze. CARDINAL BENEDICT sighs quietly, head tilted back. Father Gregory's fingers twitch over the LED buttons. Father Michael sheepishly scrolls through data on the tablet. Monsignor leans forward, hands clasped. Cardinal Benedict closes his eyes briefly. The same dimly lit Vatican room, but a small, anachronistic 'Like & Subscribe' sticker with glitter is peeling slightly from a chipped marble crucifix on the wall behind them. A high-tech smart mug sits next to Father Michael. CAMERA: Handheld slow push-in, starting on Father Gregory's twitching fingers, then quickly cuts to a medium shot centered on Michael's tablet screen, then to Monsignor's face. STYLE: Tense, slightly anachronistic, with stark shadows highlighting expressions. 9:16 vertical portrait aspect ratio",
      "dialogue": "MONSIGNOR ANTHONY: (Eyes narrowing) And this 'efficiency,' Father Michael... involved an Artificial Intelligence?\nFATHER MICHAEL: (Stammering) A collaborative assistant, Monsignor! For... theological drafting. To keep us... algorithmically relevant for new converts.\nFATHER GREGORY: (Interrupting, frantic) The youth, Monsignor! Our Sunday streams were tanking! The 'For You' page demands short-form, emotionally resonant scripture drops!\nCARDINAL BENEDICT: (A long, slow blink, then a quiet groan) 'Scripture drops.'",
      "audio_cues": "Urgent, slightly glitchy electronic hum. Frantic typing sounds. A 'ding' notification sound."
    },
    {
      "scene_number": 3,
      "veo3_visual_prompt": "MONSIGNOR ANTHONY, his face contorted in a mix of horror and profound disgust, jaw clenched so tight a vein visibly throbs in his neck. FATHER MICHAEL, still utterly oblivious, wears a hopeful, earnest smile. FATHER GREGORY, momentarily forgotten by the Monsignor, performs a fluid, slightly off-kilter, hip-rolling dance move. CARDINAL BENEDICT stares directly at the audience, a single, defeated tear slowly rolling down his cheek. Monsignor slams his fist onto the table, making a heavy, ornate chalice with a crudely etched 'fire emoji' on its base jump. Michael raises his eyebrows innocently. Gregory attempts a full, enthusiastic TikTok dance, clutching his phone. Cardinal Benedict points a trembling finger at the chalice, then at Gregory. The same Vatican meeting room. The chalice is highly polished, reflecting distorted light. A small, glowing 'For You Page' notification is visible on Gregory's phone peeking from his cassock. CAMERA: Static extreme close-up on Monsignor's enraged face, then a rapid dolly-out to a medium shot revealing the chalice and Father Gregory's dance. STYLE: Exaggerated, chaotic, and brightly lit on Gregory, darkly dramatic on Monsignor, emphasizing peak absurdity. 9:16 vertical portrait aspect ratio",
      "dialogue": "MONSIGNOR ANTHONY: (Voice trembling with barely suppressed rage) His Holiness was shown a sermon, generated by your 'collaborative assistant.'\nFATHER MICHAEL: (Beaming, oblivious) Ah, 'The Parable of the Thirsty Samaritan, but make it a thirst trap'? A real engagement driver!\nMONSIGNOR ANTHONY: (Slamming his fist down, rattling the chalice) No! The one about the 'Holy Spirit's Top 5 Glow-Up Tips for Pentecost'! Featuring... (Struggles to speak, gasping) ...a liturgical dance trend by the Angels of Revelation!\nFATHER GREGORY: (Brightening, stops dancing) With the viral sound 'Buss It Down, Angels!'? That one hit a million views!\nCARDINAL BENEDICT: (Pinches the bridge of his nose, then slowly, deliberately, points at the chalice's fire emoji, then at Father Gregory, then collapses back in his chair with a defeated sigh.)",
      "audio_cues": "Chalice clanging loudly. A sudden, jarringly upbeat, TikTok-esque soundbite (e.g., 'Oh no, oh no, oh no no no no no') followed by a rapid, comedic 'record scratch' effect. FADE TO BLACK."
    }
  ]
}